{
  "journalEntries": [
    {
      "date": "2019-07-02",
      "topic": "Orientation",
      "entry": "In the morning we watched the front-end capstone project presentations by Cohort 32. It was neat to see the wide variety of applications they have built and how much they have learned in such a short period of time. In the afternoon we listed to a talk from John.",
      "mood": "Good",
      "id": 1
    },
    {
      "id": 2,
      "date": "2019-07-12",
      "topic": "JavaScript DOM Manipulation and Objects",
      "entry": "Today we learned how to manipulate html elements in the DOM and learned the basics of JavaScript objects and how to access their properties and values",
      "mood": "Good"
    },
    {
      "id": 3,
      "date": "2019-07-15",
      "topic": "JavaScript Functions",
      "entry": "We started learning about and getting practice with functions in JavaScript. We learned the syntax of how they are laid out, the difference between declaring a function and a function expression, as well as the syntax for arrow functions.",
      "mood": "Good"
    },
    {
      "id": 4,
      "date": "2019-07-16",
      "topic": "JavaSCript Functions",
      "entry": "Today we continued getting more practice with functions in JavaScript. So far I feel relatively comfortable and have completed most or all of the exercises and challenges listed in the curriculum on Github as well as the exercises posted on Repl.it. I have been trying to get practice using Git and Github with creating new repos, creating a new branch for each exercise, pushing, merging, and pulling upon the completion of each exercise.",
      "mood": "Good"
    },
    {
      "id": 5,
      "date": "2019-07-17",
      "topic": "JS Objects/Building DOM Components",
      "entry": "Today we went over JavaScript objects and how widely used they are. We learned how to create them, assign, access, and reassign their properties. I felt comfortable with the exercises that we did. In the afternoon we went over building DOM components in JavaScript. Factory functions can be used to build representations of HTML components with JavaScript and those representations can then be displayed in the browser.",
      "mood": "Good"
    },
    {
      "id": 6,
      "date": "2019-07-18",
      "topic": "Building DOM Components",
      "entry": "Today we got some more practice with using JavaScript to build DOM components and display them in the browser. I was able to complete all of the practice and challenge exercises. Some of the challenges also covered how to create components and render them in the browser by using the built-in functions 'document.createElement()' and 'element.appendChild()'.",
      "mood": "Good"
    },
    {
      "date": "2019-07-19",
      "topic": "APIs",
      "entry": "Today we went over how to build and use an API. We learned how to use postman to build an API or check out an API and filter or make various requests (get, post, put, delete). I completed the food-api practice exercise, which included using a public api from a food website to get data on various foods, create HTML representations of the foods, and render them to the DOM.",
      "mood": "Good",
      "id": 7
    },
    {
      "date": "2019-07-22",
      "topic": "APIs",
      "entry": "Today we worked on a mini group project to get more practice working with APIs. We used fetch to get data from an API that included different types of content and then created an HTML representation of the content and rendered it to the DOM. It was good to get more practice with APIs and good to get more practice working in a group and practicing using Git and Github.",
      "mood": "Good",
      "id": 8
    },
    {
      "date": "2019-07-23",
      "topic": "Event Handlers",
      "entry": "Today we went over event handlers. There are many different types of event handlers such as click, mouseover, mouseout, keyup, keydown, etc. To use an event handler you use the addEventListener function to a DOM element. addEventListener takes two arguments, the type of event to listen for, and a callback function that is executed when the event occurs.",
      "mood": "Good",
      "id": 9
    },
    {
      "date": "2019-07-25",
      "topic": "Welcome to Nashville",
      "entry": "Today we began working on our second group project - Welcome to Nashville. Our job is to gather data from APIs and display it on the DOM, at which point the user may select a search result and add it to an itinerary. We spent all of our time today planning. We covered what we want the page to look like, what we think the index.html file should look like, and what functions we think we will need.",
      "mood": "Great",
      "id": 10
    },
    {
      "date": "2019-07-26",
      "topic": "Welcome to Nashville",
      "entry": "Today we worked on Welcome to Nashville all day. We all had to get data from a different API based on particular thing to do around Nashville (parks, restaurants, meetups, and concerts). I had the ticketmaster API and used it to pull concert data based on a keyword search. It was good practice learning how to read the documentation to use a particular API. I also completed the functionality to display the concert results and save a result to the itinerary.",
      "mood": "Great",
      "id": 11
    },
    {
      "date": "2019-07-29",
      "topic": "Welcome to Nashville",
      "entry": "Today we finished our Welcome to Nashville Project. I thought our group did a great job of getting all of getting all of the functionality to work. Everyone was able to get their data from the API, display it in a search result, and save an item to the itinerary. I also thought we did a good job of managing our git and github workflows as we only had a few merge conflicts and they were easy to resolve.",
      "mood": "Great",
      "id": 12
    }
  ]
}